## 7.1 函数处理

### 7.1.1 apply方法

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

7.1 DataFrame 对象的 mean 方法

In [2]:
np.random.seed(seed=7)
val = np.random.randint(-10,10,size=9).reshape(3, 3)
df = pd.DataFrame(val, index=list('def'), columns=list('abc'))
df

   a  b  c
d  5 -6 -7
e  9 -3  4
f -2  4  0

In [3]:
df.mean()

a    4.000000
b   -1.666667
c   -1.000000
dtype: float64

7.2 NumPy 数组的 mean 函数

In [4]:
df

   a  b  c
d  5 -6 -7
e  9 -3  4
f -2  4  0

In [5]:
np.mean(df)

0.4444444444444444

7.3 使用 apply 方法计算 DataFrame 对象的平均值

In [6]:
df.apply(np.mean)

a    4.000000
b   -1.666667
c   -1.000000
dtype: float64

In [7]:
df.apply('mean')

a    4.000000
b   -1.666667
c   -1.000000
dtype: float64

7.4 apply 方法和 axis 参数

In [8]:
df.apply(np.sum, axis=1)

d    -8
e    10
f     2
dtype: int64

7.5 apply 方法和匿名函数

In [9]:
df.apply(lambda x: x + 2)

    a  b  c
d   7 -4 -5
e  11 -1  6
f   0  6  2

7.6 apply 方法和用户自定义函数

In [10]:
def add(df, n=2):
    return df + n

In [11]:
df.apply(add)

    a  b  c
d   7 -4 -5
e  11 -1  6
f   0  6  2

7.7 apply 方法和函数的参数

In [12]:
df.apply(add, n=5)

    a  b  c
d  10 -1 -2
e  14  2  9
f   3  9  5

7.8 apply 方法和 raw 参数

In [13]:
%timeit df.apply(np.mean, raw=False)

199 µs ± 1.98 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [14]:
%timeit df.apply(np.mean, raw=True)

77 µs ± 1.21 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

7.9 使用 apply 方法应用 NumPy 数组的 square 函数

In [15]:
df

   a  b  c
d  5 -6 -7
e  9 -3  4
f -2  4  0

In [16]:
ser = df['a']
ser.apply(np.square)

d    25
e    81
f     4
Name: a, dtype: int32

7.10 使用 apply 方法指定匿名函数和用户自定义函数

In [17]:
ser.apply(lambda x: x**2)

d    25
e    81
f     4
Name: a, dtype: int64

In [18]:
def sq(val, n=2):
    return val ** n

ser.apply(sq)

d    25
e    81
f     4
Name: a, dtype: int64

### 7.1.2 DataFrame类和Series类的agg方法

7.11 : apply方法和agg方法

In [19]:
df

   a  b  c
d  5 -6 -7
e  9 -3  4
f -2  4  0

In [20]:
df.apply(np.min)

a   -2
b   -6
c   -7
dtype: int32

In [21]:
df.agg(np.min)

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\1151125557.py:1: FutureWarning: The provided callable <function min at 0x000001B023ABA5C0> is currently using DataFrame.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.agg(np.min)

a   -2
b   -6
c   -7
dtype: int32

7.12 使用 agg 方法运用多个函数

In [22]:
df.agg([np.min])

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3164571949.py:1: FutureWarning: The provided callable <function min at 0x000001B023ABA5C0> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.agg([np.min])

     a  b  c
min -2 -6 -7

In [23]:
df.agg([np.min, np.max])

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\1947773699.py:1: FutureWarning: The provided callable <function min at 0x000001B023ABA5C0> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.agg([np.min, np.max])
C:\Users\liye\AppData\Local\Temp\ipykernel_4340\1947773699.py:1: FutureWarning: The provided callable <function max at 0x000001B023ABA480> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.agg([np.min, np.max])

     a  b  c
min -2 -6 -7
max  9  4  4

7.13 使用 agg 方法运用匿名函数

In [24]:
max_min = lambda x: x.max() - x.min()
df.agg([max_min])

           a   b   c
<lambda>  11  10  11

7.14 agg 方法和函数的“__name__”属性

In [25]:
max_min.__name__ = 'max_min_name'
df.agg([max_min])

               a   b   c
max_min_name  11  10  11

7.15 agg 方法和用户自定义函数

In [26]:
def max_mean(df):
    return df.max() - df.min()

In [27]:
df.agg([max_mean])

           a   b   c
max_mean  11  10  11

7.16 agg 方法和字典

In [28]:
df.agg({'a':[np.max, np.min], 'b':np.sum})

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3298274522.py:1: FutureWarning: The provided callable <function max at 0x000001B023ABA480> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.agg({'a':[np.max, np.min], 'b':np.sum})
C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3298274522.py:1: FutureWarning: The provided callable <function min at 0x000001B023ABA5C0> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.agg({'a':[np.max, np.min], 'b':np.sum})
C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3298274522.py:1: FutureWarning: The provided callable <function sum at 0x000001B023AB9DA0> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.agg({'a':[np.max, np.min], 'b':np.sum})

       a    b
max  9.0  NaN
min -2.0  NaN
sum  NaN -5.0

7.17 agg 方法的返回

In [29]:
def add2(obj):
    return obj + 2

In [30]:
df

   a  b  c
d  5 -6 -7
e  9 -3  4
f -2  4  0

In [31]:
df.agg([add2])

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3894002460.py:1: FutureWarning: using <function add2 at 0x000001B0268FD120> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  df.agg([add2])

     a    b    c
  add2 add2 add2
d    7   -4   -5
e   11   -1    6
f    0    6    2

7.18 agg 方法的返回（多个函数）

In [32]:
df.agg([add2, np.abs])

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3914809490.py:1: FutureWarning: using <function add2 at 0x000001B0268FD120> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  df.agg([add2, np.abs])
C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3914809490.py:1: FutureWarning: using <ufunc 'absolute'> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  df.agg([add2, np.abs])

     a             b             c
  add2 absolute add2 absolute add2 absolute
d    7        5   -4        6   -5        7
e   11        9   -1        3    6        4
f    0        2    6        4    2        0

7.19 Series 类的 agg 方法

In [33]:
df

   a  b  c
d  5 -6 -7
e  9 -3  4
f -2  4  0

In [34]:
ser = df['b']
ser.agg(['max','min'])

max    4
min   -6
Name: b, dtype: int32

7.20 基于 agg 方法应用多个函数

In [35]:
ser.agg([add2, np.abs])

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\1959336239.py:1: FutureWarning: using <function add2 at 0x000001B0268FD120> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  ser.agg([add2, np.abs])
C:\Users\liye\AppData\Local\Temp\ipykernel_4340\1959336239.py:1: FutureWarning: using <ufunc 'absolute'> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  ser.agg([add2, np.abs])

   add2  absolute
d    -4         6
e    -1         3
f     6         4

### 7.1.3 applymap方法

7.21 DataFrame 类的 applymap 方法

In [36]:
df.applymap(lambda x: True if x > 0 else False)

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\2522203963.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: True if x > 0 else False)

       a      b      c
d   True  False  False
e   True  False   True
f  False   True  False

7.22 applymap 方法和 NumPy 数组的 sign 函数

In [37]:
df.applymap(np.sign)

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\1330284556.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(np.sign)

   a  b  c
d  1 -1 -1
e  1 -1  1
f -1  1  0

7.23 applymap 方法和用户自定义函数

In [38]:
#　有自变量的函数
def mapping(val, n=3):
    if val > n:
        return True
    else:
        return False

df.applymap(mapping)

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\2240861552.py:8: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(mapping)

       a      b      c
d   True  False  False
e   True  False   True
f  False   True  False

7.24 applymap 方法和匿名函数

In [39]:
df.applymap(lambda x: mapping(x, n=4))

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3245349168.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: mapping(x, n=4))

       a      b      c
d   True  False  False
e   True  False  False
f  False  False  False

7.25 Series 类的 map 方法

In [40]:
df['c']

d   -7
e    4
f    0
Name: c, dtype: int32

In [41]:
ser = df['c']
ser.map(lambda x: True if x == 0 else False)

d    False
e    False
f     True
Name: c, dtype: bool

### 7.1.4 pipe方法

7.26 多个函数的定义

In [42]:
def add(df, p=None):
    return df + p

def div(df, n=None):
    return df / n

def rnd(df, d=None):
    return round(df, d)

7.27 在 DataFrame 对象中应用多个函数

In [43]:
a = add(df, p=3)
b = div(a, n=3)
rnd(b, d=3)

       a      b      c
d  2.667 -1.000 -1.333
e  4.000  0.000  2.333
f  0.333  2.333  1.000

7.28 在 DataFrame 对象中应用多个函数（嵌套）

In [44]:
rnd(div(add(df, p=3), n=3), d=3)

       a      b      c
d  2.667 -1.000 -1.333
e  4.000  0.000  2.333
f  0.333  2.333  1.000

7.29 使用 pipe 方法传递每个函数的参数

In [45]:
df.pipe(add, p=3).pipe(div, n=3).pipe(rnd, d=5)

         a        b        c
d  2.66667 -1.00000 -1.33333
e  4.00000  0.00000  2.33333
f  0.33333  2.33333  1.00000

## 7.2 基于for语句的循环处理

### 7.2.1 Series对象的循环处理

7.30 Series 对象的创建

In [46]:
ser = pd.Series([0,1,2,3,4], index=list('abcde'))
ser

a    0
b    1
c    2
d    3
e    4
dtype: int64

7.31 Series 对象和 for 语句

In [47]:
for val in ser:
    print(val)

0
1
2
3
4

7.32 index 属性和 for 语句

In [48]:
for idx in ser.index:
    print(idx)

a
b
c
d
e

7.33 Series 对象的 iteritems 方法

In [49]:
type(ser.items())

zip

In [50]:
for idx, val in ser.items():
    print(idx, val)

a 0
b 1
c 2
d 3
e 4

7.34 Series 对象的 iteritems 方法和 if 语句

In [51]:
for idx, val in ser.items():
    if val < 3:
        print(idx)

a
b
c

### 7.2.2 DataFrame对象的循环处理

7.35 DataFrame 对象和 for 语句

In [52]:
val = [[81,79],[91,90]]
df = pd.DataFrame(val, columns=['math','eng'], index=list('AB'))
df

   math  eng
A    81   79
B    91   90

In [53]:
for col in df:
    print(col)

math
eng

7.36 columns 属性、index 属性和 for 语句

In [54]:
for col in df.columns:
    print(col)

math
eng

In [55]:
for idx in df.index:
    print(idx)

A
B

7.37 DataFrame 对象的 iterrows 方法

In [56]:
for idx,val in df.iterrows():
    print(type(idx))
    print(type(val))
    break

<class 'str'>
<class 'pandas.core.series.Series'>

In [57]:
for idx,val in df.iterrows():
    print(idx)
    print(val, '\n')

A
math    81
eng     79
Name: A, dtype: int64

B
math    91
eng     90
Name: B, dtype: int64

7.38 数据类型的确认

In [58]:
df2 = df.copy()
df2

   math  eng
A    81   79
B    91   90

In [59]:
df2.dtypes

math    int64
eng     int64
dtype: object

In [60]:
df2['math'] = [81.0, 91.0]
df2.dtypes

math    float64
eng       int64
dtype: object

7.39 Python 内置函数 next

In [61]:
df2.iterrows()

In [62]:
row = next(df2.iterrows())[1]
row

math    81.0
eng     79.0
Name: A, dtype: float64

7.40 数据类型的确认

In [63]:
print(df2['eng'].dtype)
print(row['eng'].dtype)

int64
float64

7.41 基于循环处理对值进行更新

In [64]:
df2

   math  eng
A  81.0   79
B  91.0   90

In [65]:
for idx, value in df2.iterrows():
    value['math'] = "a"

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\1683622283.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'a' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  value['math'] = "a"

In [66]:
df2 #这里为什么没有更新

   math  eng
A  81.0   79
B  91.0   90

7.42 基于循环处理对值进行更新（DataFrame 对象）

In [67]:
for idx, value in df2.iterrows():
    df2.loc[idx, 'math'] = 'a'

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\11190807.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'a' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df2.loc[idx, 'math'] = 'a'

In [68]:
df2 #这里更新了

  math  eng
A    a   79
B    a   90

7.43 基于循环处理和 if 语句的条件分支

In [69]:
for idx, value in df2.iterrows():
    if idx == 'A':
        df2.loc[idx, 'math'] = 81
    else:
        df2.loc[idx, 'math'] = 91

df2

  math  eng
A   81   79
B   91   90

7.44 DataFrame 对象的 iteritems 方法

In [70]:
for col, val in df.items():
    print(col)
    print("---->")
    print(val, '\n')
    print("<----")

math
---->
A    81
B    91
Name: math, dtype: int64

<----
eng
---->
A    79
B    90
Name: eng, dtype: int64

<----

7.45 iteritems 方法和 mean 方法

In [71]:
df

   math  eng
A    81   79
B    91   90

In [72]:
for col, val in df.items():
    mean = val.mean()
    print(col, '的平均值是 ', mean)

math 的平均值是  86.0
eng 的平均值是  84.5

7.46 DataFrame 对象的 itertuples 方法

In [73]:
for row in df.itertuples():
    print(row)

Pandas(Index='A', math=81, eng=79)
Pandas(Index='B', math=91, eng=90)

7.47 itertuples 方法和 index 参数

In [74]:
for row in df.itertuples(index=False):
    print(row)

Pandas(math=81, eng=79)
Pandas(math=91, eng=90)

7.48 命名元组的数据引用

In [75]:
for row in df.itertuples():
    print('index:', row[0], 'math :', row[1], 'eng :', row.eng)

index: A math : 81 eng : 79
index: B math : 91 eng : 90

7.49 itertuples 方法和 name 参数

In [76]:
for row in df.itertuples(name=None):
    print(row)

('A', 81, 79)
('B', 91, 90)

7.50 数据类型的确认

In [77]:
df2 = df.copy()
df2

   math  eng
A    81   79
B    91   90

In [78]:
df2['math'] = [81.0, 91.0]
df2

   math  eng
A  81.0   79
B  91.0   90

In [79]:
row = next(df2.itertuples())
row

Pandas(Index='A', math=81.0, eng=79)

In [80]:
print(df2.loc['A','eng'], 'dtype = ', type(df2.loc['A','eng']))

79 dtype =  <class 'numpy.int64'>

In [81]:
print(type(row),row)
print(row[2], 'dtype = ', type(row[2]))

<class 'pandas.core.frame.Pandas'> Pandas(Index='A', math=81.0, eng=79)
79 dtype =  <class 'int'>

## 7.3 数据的分组

### 7.3.1 GroupBy对象

7.51 ex15.csv 文件的读取

In [82]:
df = pd.read_csv('./data/ex15.csv')
df

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
4    E    Male    baseball    71   69    82
5    F    Male      tennis    69   75    84
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80
8    I    Male    baseball    88   76    72

7.52 DataFrame 对象的 groupby 方法

In [83]:
grouped = df.groupby("sex")
grouped

7.53 GroupBy 对象的 groups 属性

In [84]:
grouped.groups

{'Female': [2, 3, 6, 7], 'Male': [0, 1, 4, 5, 8]}

In [85]:
df.loc[[2,3,6,7],'sex']

2    Female
3    Female
6    Female
7    Female
Name: sex, dtype: object

7.54 GroupBy 对象的 indices 属性

In [86]:
grouped.indices

{'Female': array([2, 3, 6, 7], dtype=int64),
 'Male': array([0, 1, 4, 5, 8], dtype=int64)}

7.55 GroupBy 对象的 get_group 方法

In [87]:
grouped.get_group('Female')

  name     sex        club  math  eng  scie
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80

7.56 GroupBy 对象的 mean 方法

In [88]:
df

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
4    E    Male    baseball    71   69    82
5    F    Male      tennis    69   75    84
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80
8    I    Male    baseball    88   76    72

In [89]:
grouped.mean(numeric_only=True)

         math    eng  scie
sex
Female  83.25  83.25  86.0
Male    80.00  77.80  83.6

7.57 GroupBy 对象的 count 方法

In [90]:
grouped.count()

        name  club  math  eng  scie
sex
Female     4     4     4    4     4
Male       5     5     5    5     5

7.58 使用方括号（[ ]）对不同性别的 math 平均分数进行计算

In [91]:
grouped['math'].mean()

sex
Female    83.25
Male      80.00
Name: math, dtype: float64

7.59 使用方括号（[ ]）对列 math 和列 eng 的数据进行处理

In [92]:
grouped[['math','eng']].mean()

         math    eng
sex
Female  83.25  83.25
Male    80.00  77.80

7.60 基于多个键值的分组

In [93]:
df

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
4    E    Male    baseball    71   69    82
5    F    Male      tennis    69   75    84
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80
8    I    Male    baseball    88   76    72

In [94]:
grouped = df.groupby(['sex','club'])
grouped.mean(numeric_only=True)

                   math   eng  scie
sex    club
Female tennis      82.5  85.5  80.5
       volleyball  84.0  81.0  91.5
Male   baseball    79.5  72.5  77.0
       soccer      86.0  84.5  90.0
       tennis      69.0  75.0  84.0

7.61 groupby 方法和 as_index 参数

In [95]:
grouped = df.groupby(['sex','club'], as_index=False)
grouped.mean(numeric_only=True)

      sex        club  math   eng  scie
0  Female      tennis  82.5  85.5  80.5
1  Female  volleyball  84.0  81.0  91.5
2    Male    baseball  79.5  72.5  77.0
3    Male      soccer  86.0  84.5  90.0
4    Male      tennis  69.0  75.0  84.0

7.62 创建包含类的数据列表

In [96]:
classroom = ['1A'] * 2 + ['1B'] * 3 + ['1C'] * 2 + ['1A'] * 2
classroom

['1A', '1A', '1B', '1B', '1B', '1C', '1C', '1A', '1A']

7.63 使用外部数据进行分组

In [97]:
grouped = df.groupby([classroom, 'sex'])
grouped[['math','eng']].max()

           math  eng
   sex
1A Female    77   86
   Male      91   90
1B Female    88   85
   Male      71   69
1C Female    91   93
   Male      69   75

7.64 DataFrame 对象和 set_index 方法

In [98]:
df2 = df.copy()
df2

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
4    E    Male    baseball    71   69    82
5    F    Male      tennis    69   75    84
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80
8    I    Male    baseball    88   76    72

In [99]:
df2 = df2.set_index('club')
df2

           name     sex  math  eng  scie
club
soccer        A    Male    81   79    91
soccer        B    Male    91   90    89
volleyball    C  Female    77   69    94
tennis        D  Female    88   85    81
baseball      E    Male    71   69    82
tennis        F    Male    69   75    84
volleyball    G  Female    91   93    89
tennis        H  Female    77   86    80
baseball      I    Male    88   76    72

7.65 基于索引的 name 属性分组

In [100]:
df2.groupby(by='club').mean(numeric_only=True)

            math   eng       scie
club
baseball    79.5  72.5  77.000000
soccer      86.0  84.5  90.000000
tennis      78.0  82.0  81.666667
volleyball  84.0  81.0  91.500000

7.66 groupby 方法的 level 参数

In [101]:
df2.groupby(level=0).mean(numeric_only=True)

            math   eng       scie
club
baseball    79.5  72.5  77.000000
soccer      86.0  84.5  90.000000
tennis      78.0  82.0  81.666667
volleyball  84.0  81.0  91.500000

7.67 GroupBy 对象的迭代

In [102]:
grouped = df.groupby('sex')

for name, group in grouped:
    print(name)
    print(group[0:2], '\n')

Female
  name     sex        club  math  eng  scie
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81

Male
  name   sex    club  math  eng  scie
0    A  Male  soccer    81   79    91
1    B  Male  soccer    91   90    89

7.68 GroupBy 对象的迭代（多个键）

In [103]:
for (sex, club), group in df.groupby(['sex','club']):
    print(sex, club)

Female tennis
Female volleyball
Male baseball
Male soccer
Male tennis

7.69 GroupBy 对象的 describe 方法

In [104]:
df

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
4    E    Male    baseball    71   69    82
5    F    Male      tennis    69   75    84
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80
8    I    Male    baseball    88   76    72

In [105]:
grouped = df.groupby('club')
grouped['math'].describe()

            count  mean        std   min    25%   50%    75%   max
club
baseball      2.0  79.5  12.020815  71.0  75.25  79.5  83.75  88.0
soccer        2.0  86.0   7.071068  81.0  83.50  86.0  88.50  91.0
tennis        3.0  78.0   9.539392  69.0  73.00  77.0  82.50  88.0
volleyball    2.0  84.0   9.899495  77.0  80.50  84.0  87.50  91.0

7.70 GroupBy 对象的 filter 方法

In [106]:
for name, group in grouped:
    print(name)
    print(group[:], '\n')

baseball
  name   sex      club  math  eng  scie
4    E  Male  baseball    71   69    82
8    I  Male  baseball    88   76    72

soccer
  name   sex    club  math  eng  scie
0    A  Male  soccer    81   79    91
1    B  Male  soccer    91   90    89

tennis
  name     sex    club  math  eng  scie
3    D  Female  tennis    88   85    81
5    F    Male  tennis    69   75    84
7    H  Female  tennis    77   86    80

volleyball
  name     sex        club  math  eng  scie
2    C  Female  volleyball    77   69    94
6    G  Female  volleyball    91   93    89

In [107]:
grouped.filter(lambda x: x['math'].mean() > 80)

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
6    G  Female  volleyball    91   93    89

7.71 GroupBy 对象的 filter 方法和 len 函数

In [108]:
df.groupby('club').filter(lambda x: len(x) > 2)

  name     sex    club  math  eng  scie
3    D  Female  tennis    88   85    81
5    F    Male  tennis    69   75    84
7    H  Female  tennis    77   86    80

7.72 SeriesGroupBy 对象

In [109]:
ser_grouped = df.groupby('sex')
ser_grouped['math']

7.73 SeriesGroupBy 对象的 nlargest 方法和 nsmallest 方法

In [110]:
print(ser_grouped['math'].nlargest(n=1), '\n')
print(ser_grouped['math'].nsmallest(n=1))

sex
Female  6    91
Male    1    91
Name: math, dtype: int64

sex
Female  2    77
Male    5    69
Name: math, dtype: int64

7.74 SeriesGroupBy 对象和 value_counts 方法

In [111]:
ser_grouped['math'].value_counts()

sex     math
Female  77      2
        88      1
        91      1
Male    69      1
        71      1
        81      1
        88      1
        91      1
Name: count, dtype: int64

### 7.3.2 GroupBy对象的agg方法

7.75 GroupBy 对象的 agg 方法

In [112]:
grouped = df.groupby('sex')
grouped.mean(numeric_only=True)

         math    eng  scie
sex
Female  83.25  83.25  86.0
Male    80.00  77.80  83.6

In [113]:
grouped.agg('mean',numeric_only=True)

         math    eng  scie
sex
Female  83.25  83.25  86.0
Male    80.00  77.80  83.6

7.76 agg 方法和 NumPy 数组的 mean 函数

In [114]:
# grouped.agg(np.mean)

7.77 agg 方法和多个函数

In [115]:
grouped[['math','eng']].agg([np.max,np.min])

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3123062800.py:1: FutureWarning: The provided callable <function max at 0x000001B023ABA480> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped[['math','eng']].agg([np.max,np.min])
C:\Users\liye\AppData\Local\Temp\ipykernel_4340\3123062800.py:1: FutureWarning: The provided callable <function min at 0x000001B023ABA5C0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  grouped[['math','eng']].agg([np.max,np.min])

       math     eng
        max min max min
sex
Female   91  77  93  69
Male     91  69  90  69

7.78 agg 方法和元组

In [116]:
grouped[['math','eng']].agg([('最大值', np.max),('最小值',np.min)])

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\1890901812.py:1: FutureWarning: The provided callable <function max at 0x000001B023ABA480> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped[['math','eng']].agg([('最大值', np.max),('最小值',np.min)])
C:\Users\liye\AppData\Local\Temp\ipykernel_4340\1890901812.py:1: FutureWarning: The provided callable <function min at 0x000001B023ABA5C0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  grouped[['math','eng']].agg([('最大值', np.max),('最小值',np.min)])

       math     eng
        最大值 最小值 最大值 最小值
sex
Female   91  77  93  69
Male     91  69  90  69

7.79 agg 方法和字典

In [117]:
grouped.agg({'math':np.mean,
             'eng':np.max,
             'scie':np.min})

C:\Users\liye\AppData\Local\Temp\ipykernel_4340\2520592240.py:1: FutureWarning: The provided callable <function mean at 0x000001B023ABAE80> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  grouped.agg({'math':np.mean,
C:\Users\liye\AppData\Local\Temp\ipykernel_4340\2520592240.py:1: FutureWarning: The provided callable <function max at 0x000001B023ABA480> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({'math':np.mean,
C:\Users\liye\AppData\Local\Temp\ipykernel_4340\2520592240.py:1: FutureWarning: The provided callable <function min at 0x000001B023ABA5C0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  grouped.agg({'math':np.mean,

         math  eng  scie
sex
Female  83.25   93    80
Male    80.00   90    72

7.80 agg 方法和用户自定义函数

In [118]:
def max_min(g):
    return g.max() - g.min()

In [119]:
grouped[["math","eng","scie"]].agg(max_min)

        math  eng  scie
sex
Female    14   24    14
Male      22   21    19

7.81 agg 方法和多个分组键

In [120]:
df.groupby(['sex','club'])['math'].agg(['mean','sum'])

                   mean  sum
sex    club
Female tennis      82.5  165
       volleyball  84.0  168
Male   baseball    79.5  159
       soccer      86.0  172
       tennis      69.0   69

### 7.3.3 transform方法

7.82 ex16.csv 文件的读取

In [121]:
df = pd.read_csv('./data/ex16.csv')
df

  name category   sales
0    A    Ramen  120000
1    B  Chinese  100000
2    C  Chinese  320000
3    D    Sushi  120000
4    E    Sushi  290000
5    F    Ramen   80000
6    G    Sushi  610000

7.83 agg 方法和匿名函数

In [122]:
grouped = df.groupby('category')
grouped['sales'].agg(lambda x: x.mean())

category
Chinese    210000.0
Ramen      100000.0
Sushi      340000.0
Name: sales, dtype: float64

7.84 GroupBy 对象和 transform 方法

In [123]:
grouped['sales'].transform(lambda x: x.mean())

0    100000.0
1    210000.0
2    210000.0
3    340000.0
4    340000.0
5    100000.0
6    340000.0
Name: sales, dtype: float64

7.86 指定的函数与原始 DataFrame 对象大小相同时

In [124]:
df2 = df.copy()
df2

  name category   sales
0    A    Ramen  120000
1    B  Chinese  100000
2    C  Chinese  320000
3    D    Sushi  120000
4    E    Sushi  290000
5    F    Ramen   80000
6    G    Sushi  610000

In [125]:
df2['不同分类的平均'] = grouped["sales"].transform(lambda x: x.mean())
df2

  name category   sales   不同分类的平均
0    A    Ramen  120000  100000.0
1    B  Chinese  100000  210000.0
2    C  Chinese  320000  210000.0
3    D    Sushi  120000  340000.0
4    E    Sushi  290000  340000.0
5    F    Ramen   80000  100000.0
6    G    Sushi  610000  340000.0

7.86 指定的函数与原始 DataFrame 对象大小相同时

In [126]:
df2['万'] = grouped["sales"].transform(lambda x: x / 10000)
df2

  name category   sales   不同分类的平均     万
0    A    Ramen  120000  100000.0  12.0
1    B  Chinese  100000  210000.0  10.0
2    C  Chinese  320000  210000.0  32.0
3    D    Sushi  120000  340000.0  12.0
4    E    Sushi  290000  340000.0  29.0
5    F    Ramen   80000  100000.0   8.0
6    G    Sushi  610000  340000.0  61.0

7.87 GroupBy 对象和 sum 方法

In [127]:
df

  name category   sales
0    A    Ramen  120000
1    B  Chinese  100000
2    C  Chinese  320000
3    D    Sushi  120000
4    E    Sushi  290000
5    F    Ramen   80000
6    G    Sushi  610000

In [128]:
df2 = df.copy()
cat_total = df2.groupby('category').sum()
cat_total.columns = ['name_sum','sales_sum']
cat_total

         name_sum  sales_sum
category
Chinese        BC     420000
Ramen          AF     200000
Sushi         DEG    1020000

7.88 计算每个类别的销售额比率

In [129]:
df2 = df2.merge(cat_total, left_on='category', right_index=True)
df2['pct'] = df2['sales'] / df2['sales_sum']
df2

  name category   sales name_sum  sales_sum       pct
0    A    Ramen  120000       AF     200000  0.600000
5    F    Ramen   80000       AF     200000  0.400000
1    B  Chinese  100000       BC     420000  0.238095
2    C  Chinese  320000       BC     420000  0.761905
3    D    Sushi  120000      DEG    1020000  0.117647
4    E    Sushi  290000      DEG    1020000  0.284314
6    G    Sushi  610000      DEG    1020000  0.598039

7.89 使用 transform 方法计算每个分类的销售额比率

In [130]:
df['pct'] = grouped['sales'].transform(lambda x: x / x.sum())
df

  name category   sales       pct
0    A    Ramen  120000  0.600000
1    B  Chinese  100000  0.238095
2    C  Chinese  320000  0.761905
3    D    Sushi  120000  0.117647
4    E    Sushi  290000  0.284314
5    F    Ramen   80000  0.400000
6    G    Sushi  610000  0.598039

### 7.3.4 apply方法

7.90 ex15.csv 文件的读取

In [131]:
df = pd.read_csv('./data/ex15.csv')
df

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
4    E    Male    baseball    71   69    82
5    F    Male      tennis    69   75    84
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80
8    I    Male    baseball    88   76    72

7.91 apply 方法和 mean 方法的比较

In [132]:
%timeit df.groupby('sex')["math"].apply(lambda x: x.mean())
%timeit df.groupby('sex')["math"].mean()

320 µs ± 1.61 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)
177 µs ± 2.09 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

7.92 计算偏差值的 ssc 函数的定义

In [133]:
def ssc(df, col=None):
    temp = (df[col] - df[col].mean()) / df[col].std(ddof=0)
    df['score'] = round(50 + 10 * temp)
    df = df[['name','sex','club',col,'score']]
    return df.sort_values(by='score', ascending=False)

7.93 计算列 math 的偏差值

In [134]:
df2 = df.copy()
ssc(df2, col='math')

  name     sex        club  math  score
1    B    Male      soccer    91   62.0
6    G  Female  volleyball    91   62.0
3    D  Female      tennis    88   58.0
8    I    Male    baseball    88   58.0
0    A    Male      soccer    81   49.0
2    C  Female  volleyball    77   44.0
7    H  Female      tennis    77   44.0
4    E    Male    baseball    71   37.0
5    F    Male      tennis    69   34.0

7.94 GroupBy 对象和 apply 方法

In [135]:
df2 = df.copy()
df2.groupby('sex').apply(ssc, col='math')

         name     sex        club  math  score
sex
Female 6    G  Female  volleyball    91   62.0
       3    D  Female      tennis    88   57.0
       2    C  Female  volleyball    77   40.0
       7    H  Female      tennis    77   40.0
Male   1    B    Male      soccer    91   62.0
       8    I    Male    baseball    88   59.0
       0    A    Male      soccer    81   51.0
       4    E    Male    baseball    71   40.0
       5    F    Male      tennis    69   38.0

7.95 GroupBy 对象的 apply 方法

In [136]:
df2 = df.copy()
df2.groupby('club').apply(ssc, col='eng')

             name     sex        club  eng  score
club
baseball   8    I    Male    baseball   76   60.0
           4    E    Male    baseball   69   40.0
soccer     1    B    Male      soccer   90   60.0
           0    A    Male      soccer   79   40.0
tennis     7    H  Female      tennis   86   58.0
           3    D  Female      tennis   85   56.0
           5    F    Male      tennis   75   36.0
volleyball 6    G  Female  volleyball   93   60.0
           2    C  Female  volleyball   69   40.0

7.96 在 DataFrame 对象中代入缺失值

In [137]:
df2 = df.copy()
df2.loc[3:5,'math'] = np.nan
df2.loc[[0,6,8],'eng'] = np.nan
df2.loc[[1,7],'scie'] = np.nan

7.97 mean 方法和 fillna 方法

In [138]:
mean = round(df2[["math","eng","scie"]].mean())
mean

math    84.0
eng     79.0
scie    85.0
dtype: float64

In [139]:
df2

  name     sex        club  math   eng  scie
0    A    Male      soccer  81.0   NaN  91.0
1    B    Male      soccer  91.0  90.0   NaN
2    C  Female  volleyball  77.0  69.0  94.0
3    D  Female      tennis   NaN  85.0  81.0
4    E    Male    baseball   NaN  69.0  82.0
5    F    Male      tennis   NaN  75.0  84.0
6    G  Female  volleyball  91.0   NaN  89.0
7    H  Female      tennis  77.0  86.0   NaN
8    I    Male    baseball  88.0   NaN  72.0

In [140]:
df2.fillna(mean)

  name     sex        club  math   eng  scie
0    A    Male      soccer  81.0  79.0  91.0
1    B    Male      soccer  91.0  90.0  85.0
2    C  Female  volleyball  77.0  69.0  94.0
3    D  Female      tennis  84.0  85.0  81.0
4    E    Male    baseball  84.0  69.0  82.0
5    F    Male      tennis  84.0  75.0  84.0
6    G  Female  volleyball  91.0  79.0  89.0
7    H  Female      tennis  77.0  86.0  85.0
8    I    Male    baseball  88.0  79.0  72.0

7.98 groupby 方法和 mean 方法

In [141]:
df2.groupby('club')[["math","eng","scie"]].mean()

            math   eng  scie
club
baseball    88.0  69.0  77.0
soccer      86.0  90.0  91.0
tennis      77.0  82.0  82.5
volleyball  84.0  69.0  91.5

7.99 使用 apply 方法和匿名函数对缺失值进行置换

In [142]:
grouped = df2.groupby('club')
grouped[["math","eng","scie"]].apply(lambda x: x.fillna(x.mean()))

              math   eng  scie
club
baseball   4  88.0  69.0  82.0
           8  88.0  69.0  72.0
soccer     0  81.0  90.0  91.0
           1  91.0  90.0  91.0
tennis     3  77.0  85.0  81.0
           5  77.0  75.0  84.0
           7  77.0  86.0  82.5
volleyball 2  77.0  69.0  94.0
           6  91.0  69.0  89.0